; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=38, out_folder=htg/blocksworld/training, instance_id=18, seed=2042, goal_proportion=0.1

(define (problem blocksworld-18)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b4)
    (on b4 b21)
    (on b21 b34)
    (on b34 b13)
    (on b13 b6)
    (on b6 b32)
    (on b32 b18)
    (on b18 b19)
    (on b19 b36)
    (on-table b36)
    (clear b25)
    (on b25 b26)
    (on b26 b31)
    (on b31 b2)
    (on b2 b24)
    (on b24 b5)
    (on b5 b35)
    (on b35 b14)
    (on b14 b9)
    (on-table b9)
    (clear b28)
    (on b28 b12)
    (on b12 b38)
    (on-table b38)
    (clear b17)
    (on b17 b37)
    (on b37 b16)
    (on-table b16)
    (clear b8)
    (on b8 b3)
    (on b3 b30)
    (on b30 b23)
    (on b23 b29)
    (on b29 b1)
    (on-table b1)
    (clear b27)
    (on b27 b7)
    (on-table b7)
    (clear b20)
    (on b20 b10)
    (on b10 b33)
    (on b33 b15)
    (on-table b15)
    (clear b22)
    (on-table b22))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 0 of 4
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 4
3. (unstack b3 b30)
   deleted: (on b3 b30) (clear b3) (arm-empty)
   added: (holding b3) (clear b30)
   goals met: 0 of 4
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 4
5. (unstack b30 b23)
   deleted: (on b30 b23) (clear b30) (arm-empty)
   added: (holding b30) (clear b23)
   goals met: 1 of 4
6. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 1 of 4
7. (unstack b23 b29)
   deleted: (on b23 b29) (clear b23) (arm-empty)
   added: (holding b23) (clear b29)
   goals met: 1 of 4
8. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 1 of 4
9. (unstack b29 b1)
   deleted: (on b29 b1) (clear b29) (arm-empty)
   added: (holding b29) (clear b1)
   goals met: 2 of 4
10. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 4
11. (unstack b25 b26)
   deleted: (on b25 b26) (clear b25) (arm-empty)
   added: (holding b25) (clear b26)
   goals met: 2 of 4
12. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 4
13. (unstack b26 b31)
   deleted: (on b26 b31) (clear b26) (arm-empty)
   added: (holding b26) (clear b31)
   goals met: 2 of 4
14. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 4
15. (unstack b31 b2)
   deleted: (on b31 b2) (clear b31) (arm-empty)
   added: (holding b31) (clear b2)
   goals met: 2 of 4
16. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 4
17. (unstack b2 b24)
   deleted: (on b2 b24) (clear b2) (arm-empty)
   added: (holding b2) (clear b24)
   goals met: 2 of 4
18. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 3 of 4
19. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 2 of 4
20. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 4
